<?php
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
！！！！警告！！！！
以下为系统文件，请勿修改
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

//不能非法包含或直接执行
if (!defined('IN_GINKGO')) {
    return 'Access denied';
}

/*++++++提示信息++++++
x开头为错误
y开头为成功
++++++++++++++++++*/

return array(
    /*@@@@@@ x-1---- 用户 @@@@@@*/

    /*++++++ x-1-1-- 数据 ++++++*/
    'y010101' => '用户注册成功',
    'x010101' => '用户注册失败',
    'y010102' => '用户存在',
    'x010102' => '用户不存在',
    'y010103' => '更新用户成功',
    'x010103' => '没有做任何修改',
    'y010104' => '删除用户成功',
    'x010104' => '未删除任何用户',
    'y010105' => '创建用户表成功',
    'x010105' => '创建用户表失败',
    'y010106' => '更新用户表成功',
    'x010106' => '没有做任何修改',
    'y010107' => '删除用户表成功',
    'x010107' => '未删除任何表',

    'y010108' => '创建用户视图成功',
    'x010108' => '创建用户视图失败',

    'y010111' => '无需更新用户表',

    /*++++++ x-1-2-- 验证 ++++++*/
    'y010201' => '验证通过',
    'x010201' => '输入错误',
    'x010202' => '获取用户 ID 错误',
    'x010203' => '获取用户名错误',

    /*++++++ x-1-3-- 权限 ++++++*/
    'x010301' => '您没有浏览用户的权限',
    'x010302' => '您没有创建用户的权限',
    'x010303' => '您没有编辑用户的权限',
    'x010304' => '您没有删除用户的权限',
    'x010305' => '您没有批量导入的权限',

    /*++++++ x-1-4-- 状态 ++++++*/
    'x010402' => '用户被禁用',
    'x010403' => '您没有设置邮箱和密保问题，无法找回密码，请联系系统管理员！',
    'x010404' => '用户已存在',
    'y010405' => '更换邮箱成功',
    'x010405' => '更换邮箱失败',
    'y010406' => '找回密码成功',
    'x010406' => '找回密码失败',
    'x010407' => '发送确认邮件失败',

    /*@@@@@@ x-2---- 管理员 @@@@@@*/

    /*++++++ x-2-1-- 数据 ++++++*/
    'y020101' => '创建管理员成功',
    'x020101' => '创建管理员失败',
    'y020102' => '管理员存在',
    'x020102' => '管理员未授权',
    'y020103' => '更新管理员成功',
    'x020103' => '没有做任何修改',
    'y020104' => '删除管理员成功',
    'x020104' => '未删除任何管理员',
    'y020105' => '创建管理员表成功',
    'x020105' => '创建管理员表失败',
    'y020106' => '更新管理员表成功',
    'x020106' => '没有做任何修改',
    'y020107' => '删除管理员表成功',
    'x020107' => '未删除任何表',

    'y020111' => '无需更新管理员表',

    /*++++++ x-2-2-- 验证 ++++++*/
    'y020201' => '验证通过',
    'x020201' => '输入错误',
    'x020202' => '获取管理员 ID 错误',
    'x020203' => '获取用户名错误',

    /*++++++ x-2-3-- 权限 ++++++*/
    'x020301' => '您没有浏览管理员的权限',
    'x020302' => '您没有创建管理员的权限',
    'x020303' => '您没有编辑管理员的权限',
    'x020304' => '您没有删除管理员的权限',
    'x020305' => '禁止更新个人资料',
    'x020306' => '不能编辑自己',
    'x020307' => '您没有加入组的权限',

    /*++++++ x-2-4-- 状态 ++++++*/
    'y020401' => '管理员登录成功',
    'x020402' => '管理员被禁用',
    'x020403' => '登录校验错误',
    'x020404' => '管理员已存在',
    'x020405' => '登录超时，请重新登录！',


    /*@@@@@@ x-3---- 系统 @@@@@@*/

    /*++++++ x-3-1-- 数据 ++++++*/

    /*++++++ x-3-2-- 验证 ++++++*/
    'y030201' => '验证通过',
    'x030201' => '输入错误',
    'x030202' => '验证码错误',
    'x030204' => '请选择安装方式',

    /*++++++ x-3-3-- php 权限 ++++++*/
    'x030301' => '您没有设置的权限',

    /*++++++ x-3-4-- 状态 ++++++*/
    'y030401' => '设置成功',
    'x030401' => '设置失败',
    'y030402' => '系统未安装',
    'x030402' => '系统已安装',
    'x030403' => '需要执行安装程序',
    'x030404' => '需要执行升级程序',
    'x030405' => '缺少必要的 PHP 扩展',
    'x030406' => '签名错误',
    'x030407' => '解密失败',
    'x030408' => '加密失败',
    'x030409' => '未正确设置数据库',
    'x030410' => '模板不存在',
    'x030411' => '全新安装时禁用',
    'y030412' => '系统未安装',
    'x030412' => '系统已安装',
    'y030413' => '清除 Cookie 成功',


    /*@@@@@@ x-4---- 群组 @@@@@@*/

    /*++++++ x-4-1-- 数据 ++++++*/
    'y040101' => '创建群组成功',
    'x040101' => '创建群组失败',
    'y040102' => '群组存在',
    'x040102' => '群组不存在',
    'y040103' => '更新群组成功',
    'x040103' => '没有做任何修改',
    'y040104' => '删除群组成功',
    'x040104' => '未删除任何群组',
    'y040105' => '创建群组表成功',
    'x040105' => '创建群组表失败',
    'y040106' => '更新群组表成功',
    'x040106' => '没有做任何修改',
    'y040107' => '删除群组表成功',
    'x040107' => '未删除任何表',
    'y040111' => '无需更新群组表',

    /*++++++ x-4-2-- 验证 ++++++*/
    'y040201' => '验证通过',
    'x040201' => '输入错误',
    'x040202' => '获取群组 ID 错误',

    /*++++++ x-4-3-- 权限 ++++++*/
    'x040301' => '您没有浏览群组的权限',
    'x040302' => '您没有创建群组的权限',
    'x040303' => '您没有编辑群组的权限',
    'x040304' => '您没有删除群组的权限',

    /*++++++ x-4-3-- 权限 ++++++*/
    'x040401' => '群组被禁用',


    /*@@@@@@ x-5---- 应用 @@@@@@*/

    /*++++++ x-5-1-- 数据 ++++++*/
    'y050101' => '创建应用成功',
    'x050101' => '创建应用失败',
    'y050102' => '应用存在',
    'x050102' => '应用不存在',
    'y050103' => '更新应用成功',
    'x050103' => '没有做任何修改',
    'y050104' => '删除应用成功',
    'x050104' => '未删除任何应用',
    'y050105' => '创建应用表成功',
    'x050105' => '创建应用表失败',
    'y050106' => '更新应用表成功',
    'x050106' => '没有做任何修改',
    'y050107' => '删除应用表成功',
    'x050107' => '未删除任何表',

    'y050111' => '无需更新应用表',

    /*++++++ x-5-2-- 验证 ++++++*/
    'y050201' => '验证通过',
    'x050201' => '输入错误',
    'x050202' => '获取应用 ID 错误',
    'x050203' => '解码错误',

    /*++++++ x-5-3-- 权限 ++++++*/
    'x050301' => '您没有浏览应用的权限',
    'x050302' => '您没有创建应用的权限',
    'x050303' => '您没有编辑应用的权限',
    'x050304' => '您没有删除应用的权限',
    'x050305' => '您没有授权的权限',

    'x050307' => '本应用没有用户注册权限',
    'x050308' => '本应用没有编辑用户权限',
    'x050309' => '本应用没有删除用户权限',

    'x050316' => '系统禁止注册',

    /*++++++ x-5-4-- 状态 ++++++*/
    'x050402' => '应用被禁用',
    'x050403' => '签名错误',
    'x050405' => '加密失败',
    'x050406' => '解密失败',
    'x050407' => '不允许访问的 IP 地址',
    'x050408' => '禁止访问的 IP 地址',


    /*@@@@@@ x-6---- 相册 @@@@@@*/

    /*++++++ x-6-1-- 数据 ++++++*/
    'y060101' => '创建相册成功',
    'x060101' => '创建相册失败',
    'y060102' => '相册存在',
    'x060102' => '相册未授权',
    'y060103' => '更新相册成功',
    'x060103' => '没有做任何修改',
    'y060104' => '删除相册成功',
    'x060104' => '未删除任何相册',
    'y060105' => '创建相册表成功',
    'x060105' => '创建相册表失败',
    'y060106' => '更新相册表成功',
    'x060106' => '没有做任何修改',
    'y060107' => '删除相册表成功',
    'x060107' => '未删除任何表',

    'y060111' => '无需更新相册表',

    /*++++++ x-6-2-- 验证 ++++++*/
    'y060201' => '验证通过',
    'x060201' => '输入错误',
    'x060202' => '获取相册 ID 错误',

    /*++++++ x-6-3-- 权限 ++++++*/
    'x060301' => '您没有浏览相册的权限',
    'x060302' => '您没有创建相册的权限',
    'x060303' => '您没有编辑相册的权限',
    'x060304' => '您没有删除相册的权限',

    /*++++++ x-6-4-- 状态 ++++++*/



    /*@@@@@@ x-7---- 附件数据 @@@@@@*/

    /*++++++ x-7-1-- 数据 ++++++*/
    'y070101' => '创建附件数据成功',
    'x070101' => '创建附件数据失败',
    'y070102' => '附件数据存在',
    'x070102' => '附件数据不存在',
    'y070103' => '更新附件数据成功',
    'x070103' => '没有做任何修改',
    'y070104' => '删除附件数据成功',
    'x070104' => '未删除任何附件数据',

    'y070105' => '创建附件表成功',
    'x070105' => '创建附件表失败',
    'y070106' => '更新附件表成功',
    'x070106' => '没有做任何修改',
    'y070107' => '删除附件表成功',
    'x070107' => '未删除任何表',

    'y070108' => '创建附件视图成功',
    'x070108' => '创建附件视图失败',

    'y070111' => '无需更新附件表',
    'y070112' => '附件表更名成功',
    'x070112' => '附件表更名失败',
    'y070113' => '附件表无需更名',

    /*++++++ x-7-2-- 验证 ++++++*/
    'x070201' => '请选择要上传的文件',
    'x070202' => '获取附件 ID 错误',
    'x070203' => '上传文件不能超过',
    'x070204' => '同时上传不能超过',
    'x070205' => '请选择状态',
    'x070206' => '上传校验错误',
    'x070207' => 'MIME 校验错误',
    'x070208' => '不允许上传的类型',

    /*++++++ x-7-3-- 权限 ++++++*/
    'x070301' => '您没有浏览附件的权限',
    'x070302' => '您没有上传的权限',
    'x070303' => '您没有编辑附件的权限',
    'x070304' => '您没有删除附件的权限',

    /*++++++ x-6-4-- 状态 ++++++*/
    'y070401' => '上传成功',
    'x070401' => '上传失败',
    'y070402' => '生成缩略图成功',
    'x070402' => '未生成缩略图',
    'y070403' => '上传初始化成功',
    'x070403' => '上传初始化失败',
    'x070405' => '尚未设置 MIME',
    'y070406' => '此附件被使用',
    'x070406' => '此附件未使用',
    'y070407' => '附件清理完毕',
    'x070407' => '正在清理附件',
    'y070408' => '回收站清空完毕',
    'x070408' => '正在清空回收站',
    'y070409' => '重新生成缩略图完毕',
    'x070409' => '正在重新生成缩略图',
    'y070410' => '修复附件成功',
    'x070410' => '修复附件失败',



    /*@@@@@@ x-8---- 上传类型 @@@@@@*/

    /*++++++ x-8-1-- 数据 ++++++*/
    'y080101' => '创建 MIME 成功',
    'x080101' => '创建 MIME 失败',
    'y080102' => 'MIME 存在',
    'x080102' => 'MIME 不存在',
    'y080103' => '更新 MIME 成功',
    'x080103' => '没有做任何修改',
    'y080104' => '删除 MIME 成功',
    'x080104' => '未删除任何 MIME',
    'y080105' => '创建 MIME 表成功',
    'x080105' => '创建 MIME 表失败',
    'y080106' => '更新 MIME 表成功',
    'x080106' => '没有做任何修改',
    'y080107' => '删除 MIME 表成功',
    'x080107' => '未删除任何表',
    'y080111' => '无需更新 MIME 表',

    /*++++++ x-8-2-- 验证 ++++++*/
    'y080201' => '验证通过',
    'x080201' => '输入错误',
    'x080202' => '获取 MIME ID 错误',

    /*++++++ x-8-3-- 权限 ++++++*/
    'x080301' => '您没有浏览 MIME 的权限',
    'x080302' => '您没有创建 MIME 的权限',
    'x080303' => '您没有编辑 MIME 的权限',
    'x080304' => '您没有删除 MIME 的权限',

    /*++++++ x-8-4-- 状态 ++++++*/
    'x080404' => 'MIME 已存在',

    /*@@@@@@ x-9---- 缩略图 @@@@@@*/

    /*++++++ x-9-1-- 数据 ++++++*/
    'y090101' => '创建缩略图成功',
    'x090101' => '创建缩略图失败',
    'y090102' => '缩略图存在',
    'x090102' => '缩略图不存在',
    'y090103' => '更新缩略图成功',
    'x090103' => '没有做任何修改',
    'y090104' => '删除缩略图成功',
    'x090104' => '未删除任何缩略图',

    'y090105' => '创建缩略图表成功',
    'x090105' => '创建缩略图表失败',
    'y090106' => '更新缩略图表成功',
    'x090106' => '没有做任何修改',
    'y090107' => '删除缩略图表成功',
    'x090107' => '未删除任何表',

    'y090110' => '更新缩略图缓存成功',
    'x090110' => '更新缩略图缓存失败',
    'y090111' => '无需更新缩略图表',

    /*++++++ x-9-2-- 验证 ++++++*/
    'y090201' => '验证通过',
    'x090201' => '输入错误',
    'x090202' => '获取缩略图 ID 错误',

    /*++++++ x-9-3-- 权限 ++++++*/
    'x090301' => '您没有浏览缩略图的权限',
    'x090302' => '您没有创建缩略图的权限',
    'x090303' => '您没有编辑缩略图的权限',
    'x090304' => '您没有删除缩略图的权限',

    /*++++++ x-9-4-- 状态 ++++++*/
    'x090404' => '缩略图已存在',


    /*++++++ x10-1-- 通知 ++++++*/

    /*++++++ x10-2-- 验证 ++++++*/
    'y100201' => '验证通过',
    'x100201' => '输入错误',

    /*++++++ x10-4-- 验证 ++++++*/
    'x100401' => '签名错误',
    'x100402' => '加密失败',
    'x100403' => '解密失败',

    /*@@@@@@ x12---- 文章 @@@@@@*/

    /*++++++ x12-1-- 数据 ++++++*/
    'y120101' => '创建文章成功',
    'x120101' => '创建文章失败',
    'y120102' => '文章存在',
    'x120102' => '文章不存在',
    'y120103' => '更新文章成功',
    'x120103' => '没有做任何修改',
    'y120104' => '删除文章成功',
    'x120104' => '未删除任何文章',
    'y120105' => '创建文章表成功',
    'x120105' => '创建文章表失败',
    'y120106' => '更新文章表成功',
    'x120106' => '没有做任何修改',
    'y120107' => '删除文章表成功',
    'x120107' => '未删除任何表',
    'y120108' => '创建文章视图成功',
    'y120109' => '创建文章索引成功',
    'x120109' => '创建文章索引失败',

    'y120111' => '无需更新文章表',


    'y120112' => '复制文章表成功',
    'x120112' => '复制文章表失败',
    'y120113' => '丢弃文章表部分内容成功',
    'x120113' => '未丢弃文章表部分内容',

    'x120114' => '创建文章视图失败',
    'x120115' => '创建文章视图失败',
    'x120117' => '创建文章视图失败',

    'x120117' => '创建文章索引失败',
    'x120118' => '创建文章索引失败',
    'x120119' => '创建文章索引失败',
    'x120120' => '创建文章索引失败',
    'x120121' => '创建文章索引失败',
    'x120122' => '创建文章索引失败',


    /*++++++ x12-2-- 验证 ++++++*/
    'y120201' => '验证通过',
    'x120201' => '输入错误',
    'x120202' => '获取文章 ID 错误',

    /*++++++ x12-3-- 权限 ++++++*/
    'x120301' => '您没有浏览文章的权限',
    'x120302' => '您没有创建文章的权限',
    'x120303' => '您没有编辑文章的权限',
    'x120304' => '您没有删除文章的权限',

    /*++++++ x12-4-- 状态 ++++++*/
    'x120401' => '文章已生成过',
    'x120402' => '栏目状态导致无法显示',
    'x120403' => '该文章是跳转',
    'x120404' => '文章状态导致无法显示',
    'y120405' => '文章生成成功',
    'x120405' => '文章生成失败',
    'y120406' => '生成完毕',
    'x120406' => '文章模板不存在',


    /*@@@@@@ x13---- TAG @@@@@@*/

    /*++++++ x13-1-- 数据 ++++++*/
    'y130101' => '创建 TAG 成功',
    'x130101' => '创建 TAG 失败',
    'y130102' => 'TAG 存在',
    'x130102' => 'TAG 不存在',
    'y130103' => '更新 TAG 成功',
    'x130103' => '没有做任何修改',
    'y130104' => '删除 TAG 成功',
    'x130104' => '未删除任何 TAG',
    'y130105' => '创建 TAG 表成功',
    'x130105' => '创建 TAG 表失败',
    'y130106' => '更新 TAG 表成功',
    'x130106' => '没有做任何修改',
    'y130107' => '删除 TAG 表成功',
    'x130107' => '未删除任何表',
    'y130109' => '创建 TAG 索引成功',
    'x130109' => '创建 TAG 索引失败',
    'y130111' => '无需更新 TAG 表',

    /*++++++ x13-3-- 权限 ++++++*/
    'x130301' => '您没有浏览 TAG 的权限',
    'x130302' => '您没有创建 TAG 的权限',
    'x130303' => '您没有编辑 TAG 的权限',
    'x130304' => '您没有删除 TAG 的权限',

    /*++++++ x13-3-- 权限 ++++++*/
    'x130404' => 'TAG 已存在',



    /*@@@@@@ x14---- 标记 @@@@@@*/

    /*++++++ x14-1-- 数据 ++++++*/
    'y140101' => '创建标记成功',
    'x140101' => '创建标记失败',
    'y140102' => '标记存在',
    'x140102' => '标记不存在',
    'y140103' => '更新标记成功',
    'x140103' => '没有做任何修改',
    'y140104' => '删除标记成功',
    'x140104' => '未删除任何标记',
    'y140105' => '创建标记表成功',
    'x140105' => '创建标记表失败',
    'y140106' => '更新标记表成功',
    'x140106' => '没有做任何修改',
    'y140107' => '删除标记表成功',
    'x140107' => '未删除任何表',
    'y140111' => '无需更新标记表',

    /*++++++ x14-2-- 验证 ++++++*/
    'y140201' => '验证通过',
    'x140201' => '输入错误',
    'x140202' => '获取标记 ID 错误',

    /*++++++ x14-3-- 权限 ++++++*/
    'x140301' => '您没有浏览标记的权限',
    'x140302' => '您没有创建标记的权限',
    'x140303' => '您没有编辑标记的权限',
    'x140304' => '您没有删除标记的权限',

    /*++++++ x14-4-- 状态 ++++++*/
    'x140404' => '标记已存在',


    /*@@@@@@ x15---- 文章内容 @@@@@@*/

    /*++++++ x15-1-- 数据 ++++++*/
    'y150101' => '创建文章成功',
    'x150101' => '创建文章失败',
    'y150102' => '文章存在',
    'x150102' => '文章不存在',
    'y150103' => '更新文章成功',
    'x150103' => '没有做任何修改',
    'y150104' => '删除文章成功',
    'x150104' => '未删除任何文章',
    'y150105' => '创建文章表成功',
    'x150105' => '创建文章表失败',
    'y150106' => '更新文章表成功',
    'x150106' => '没有做任何修改',
    'y150107' => '删除文章表成功',
    'x150107' => '未删除任何表',
    'y150109' => '创建文章索引成功',
    'x150109' => '创建文章索引失败',

    'y150111' => '无需更新文章表',


    /*@@@@@@ x16---- TAG 从属 @@@@@@*/

    /*++++++ x16-1-- 数据 ++++++*/
    'y160101' => '创建 TAG 从属成功',
    'x160101' => '创建 TAG 从属失败',
    'y160102' => 'TAG 从属存在',
    'x160102' => 'TAG 从属不存在',
    'y160103' => '更新 TAG 从属成功',
    'x160103' => '没有做任何修改',
    'y160104' => '删除 TAG 从属成功',
    'x160104' => '未删除任何 TAG 从属',
    'y160105' => '创建 TAG 从属表成功',
    'x160105' => '创建 TAG 从属表失败',
    'y160106' => '更新 TAG 从属表成功',
    'x160106' => '没有做任何修改',
    'y160107' => '删除 TAG 从属表成功',
    'x160107' => '未删除任何表',

    'y160111' => '无需更新 TAG 从属表',


    /*@@@@@@ x17---- 调用 @@@@@@*/

    /*++++++ x17-1-- 数据 ++++++*/
    'y170101' => '创建调用成功',
    'x170101' => '创建调用失败',
    'y170102' => '调用存在',
    'x170102' => '调用不存在',
    'y170103' => '更新调用成功',
    'x170103' => '没有做任何修改',
    'y170104' => '删除调用成功',
    'x170104' => '未删除任何调用',
    'y170105' => '创建调用表成功',
    'x170105' => '创建调用表失败',
    'y170106' => '更新调用表成功',
    'x170106' => '没有做任何修改',
    'y170107' => '删除调用表成功',
    'x170107' => '未删除任何表',

    'y170111' => '无需更新调用表',

    'y170112' => '克隆调用成功',
    'x170112' => '克隆调用失败',

    /*++++++ x17-2-- 验证 ++++++*/
    'y170201' => '验证通过',
    'x170201' => '输入错误',
    'x170202' => '获取标记 ID 错误',

    /*++++++ x17-3-- 权限 ++++++*/
    'x170301' => '您没有浏览调用的权限',
    'x170302' => '您没有创建调用的权限',
    'x170303' => '您没有编辑调用的权限',
    'x170304' => '您没有删除调用的权限',

    /*++++++ x17-4-- 状态 ++++++*/
    'y170405' => '生成调用成功',
    'x170405' => '生成调用失败',
    'y170406' => '生成完毕',
    'x170406' => '调用模板不存在',


    /*@@@@@@ x18---- 专题 @@@@@@*/

    /*++++++ x18-1-- 数据 ++++++*/
    'y180101' => '创建专题成功',
    'x180101' => '创建专题失败',
    'y180102' => '专题存在',
    'x180102' => '专题不存在',
    'y180103' => '更新专题成功',
    'x180103' => '没有做任何修改',
    'y180104' => '删除专题成功',
    'x180104' => '未删除任何专题',
    'y180105' => '创建专题表成功',
    'x180105' => '创建专题表失败',
    'y180106' => '更新专题表成功',
    'x180106' => '没有做任何修改',
    'y180107' => '删除专题表成功',
    'x180107' => '未删除任何表',
    'y180111' => '无需更新专题表',

    /*++++++ x18-2-- 验证 ++++++*/
    'y180201' => '验证通过',
    'x180201' => '输入错误',
    'x180202' => '获取专题 ID 错误',

    /*++++++ x18-3-- 权限 ++++++*/
    'x180301' => '您没有浏览专题的权限',
    'x180302' => '您没有创建专题的权限',
    'x180303' => '您没有编辑专题的权限',
    'x180304' => '您没有删除专题的权限',

    /*++++++ x18-4-- 状态 ++++++*/
    'y180405' => '生成专题成功',
    'x180405' => '生成专题失败',
    'y180406' => '生成完毕',


    /*@@@@@@ x19---- 插件 @@@@@@*/

    /*++++++ x19-1-- 数据 ++++++*/
    'y190101' => '安装插件成功',
    'x190101' => '安装插件失败',
    'y190102' => '插件存在',
    'x190102' => '插件不存在',
    'y190103' => '更新插件成功',
    'x190103' => '没有做任何修改',
    'y190104' => '卸载插件成功',
    'x190104' => '未卸载任何插件',
    'y190108' => '更新插件设置成功',

    /*++++++ x19-2-- 验证 ++++++*/
    'y190201' => '验证通过',
    'x190201' => '输入错误',
    'x190203' => '获取插件目录错误',

    /*++++++ x19-3-- 权限 ++++++*/
    'x190301' => '您没有浏览插件的权限',
    'x190302' => '您没有安装插件的权限',
    'x190303' => '您没有编辑插件的权限',
    'x190304' => '您没有卸载插件的权限',

    /*++++++ x19-4-- 状态 ++++++*/
    'x190401' => '没有可供设置的选项',
    'x190404' => '插件已安装',



    /*@@@@@@ x20---- 自定义字段 @@@@@@*/

    /*++++++ x20-1-- 数据 ++++++*/
    'y200101' => '创建自定义字段成功',
    'x200101' => '创建自定义字段失败',
    'y200102' => '自定义字段存在',
    'x200102' => '自定义字段不存在',
    'y200103' => '更新自定义字段成功',
    'x200103' => '没有做任何修改',
    'y200104' => '删除自定义字段成功',
    'x200104' => '未删除任何自定义字段',
    'y200105' => '创建自定义字段表成功',
    'x200105' => '创建自定义字段表失败',
    'y200106' => '更新自定义字段表成功',
    'x200106' => '没有做任何修改',
    'y200107' => '删除自定义字段表成功',
    'x200107' => '未删除任何表',

    'y200109' => '创建自定义字段索引成功',
    'x200109' => '创建自定义字段索引失败',
    'y200110' => '更新自定义字段缓存成功',
    'x200110' => '创建自定义字段缓存失败',

    'y200111' => '无需更新自定义字段表',

    /*++++++ x20-2-- 验证 ++++++*/
    'y200201' => '验证通过',
    'x200201' => '输入错误',
    'x200202' => '获取自定义字段 ID 错误',

    /*++++++ x20-3-- 权限 ++++++*/
    'x200301' => '您没有浏览自定义字段的权限',
    'x200302' => '您没有创建自定义字段的权限',
    'x200303' => '您没有编辑自定义字段的权限',
    'x200304' => '您没有删除自定义字段的权限',

    /*++++++ x20-4-- 状态 ++++++*/
    'x200402' => '自定义字段被禁用',


    /*@@@@@@ x21---- 自定义字段关联 @@@@@@*/

    /*++++++ x21-1-- 数据 ++++++*/
    'y210101' => '创建自定义字段关联成功',
    'x210101' => '创建自定义字段关联失败',
    'y210102' => '自定义字段关联存在',
    'x210102' => '自定义字段关联不存在',
    'y210103' => '更新自定义字段关联成功',
    'x210103' => '没有做任何修改',
    'y210104' => '删除自定义字段关联成功',
    'x210104' => '未删除任何自定义字段',
    'y210105' => '创建自定义字段关联表成功',
    'x210105' => '创建自定义字段关联表失败',
    'y210108' => '创建自定义字段关联视图成功',
    'x210108' => '创建自定义字段关联视图失败',


    /*@@@@@@ x22---- 栏目从属 @@@@@@*/

    /*++++++ x22-1-- 数据 ++++++*/
    'y220101' => '创建栏目从属成功',
    'x220101' => '创建栏目从属失败',
    'y220102' => '栏目从属存在',
    'x220102' => '栏目从属不存在',
    'y220103' => '更新栏目从属成功',
    'x220103' => '没有做任何修改',
    'y220104' => '删除栏目从属成功',
    'x220104' => '未删除任何栏目从属',
    'y220105' => '创建栏目从属表成功',
    'x220105' => '创建栏目从属表失败',
    'y220106' => '更新栏目从属表成功',
    'x220106' => '没有做任何修改',
    'y220107' => '删除栏目从属表成功',
    'x220107' => '未删除任何表',

    'y220111' => '无需更新栏目从属表',


    /*@@@@@@ x23---- 专题从属 @@@@@@*/

    /*++++++ x23-1-- 数据 ++++++*/
    'y230101' => '创建专题从属成功',
    'x230101' => '创建专题从属失败',
    'y230102' => '专题从属存在',
    'x230102' => '专题从属不存在',
    'y230103' => '更新专题从属成功',
    'x230103' => '没有做任何修改',
    'y230104' => '删除专题从属成功',
    'x230104' => '未删除任何专题从属',
    'y230105' => '创建专题从属表成功',
    'x230105' => '创建专题从属表失败',
    'y230106' => '更新专题从属表成功',
    'x230106' => '没有做任何修改',
    'y230107' => '删除专题从属表成功',
    'x230107' => '未删除任何表',

    'y230111' => '无需更新专题从属表',


    /*@@@@@@ x24---- 链接 @@@@@@*/

    /*++++++ x24-1-- 数据 ++++++*/
    'y240101' => '创建链接成功',
    'x240101' => '创建链接失败',
    'y240102' => '链接存在',
    'x240102' => '链接不存在',
    'y240103' => '更新链接成功',
    'x240103' => '没有做任何修改',
    'y240104' => '删除链接成功',
    'x240104' => '未删除任何链接',
    'y240105' => '创建链接表成功',
    'x240105' => '创建链接表失败',
    'y240106' => '更新链接表成功',
    'x240106' => '没有做任何修改',
    'y240107' => '删除链接表成功',
    'x240107' => '未删除任何表',
    'y240111' => '无需更新链接表',
    'y240112' => '更新链接缓存成功',

    /*++++++ x24-2-- 验证 ++++++*/
    'y240201' => '验证通过',
    'x240201' => '输入错误',
    'x240202' => '获取链接 ID 错误',

    /*++++++ x24-3-- 权限 ++++++*/
    'x240301' => '您没有浏览链接的权限',
    'x240302' => '您没有创建链接的权限',
    'x240303' => '您没有编辑链接的权限',
    'x240304' => '您没有删除链接的权限',


    /*@@@@@@ x25---- 栏目 @@@@@@*/

    /*++++++ x25-1-- 数据 ++++++*/
    'y250101' => '创建栏目成功',
    'x250101' => '创建栏目失败',
    'y250102' => '栏目存在',
    'x250102' => '栏目不存在',
    'y250103' => '更新栏目成功',
    'x250103' => '没有做任何修改',
    'y250104' => '删除栏目成功',
    'x250104' => '未删除任何栏目',
    'y250105' => '创建栏目表成功',
    'x250105' => '创建栏目表失败',
    'y250106' => '更新栏目表成功',
    'x250106' => '没有做任何修改',
    'y250107' => '删除栏目表成功',
    'x250107' => '未删除任何表',

    'y250109' => '创建栏目索引成功',
    'x250109' => '创建栏目索引失败',

    'y250110' => '更新栏目缓存成功',
    'x250110' => '更新栏目缓存失败',
    'y250111' => '无需更新栏目表',

    'y250112' => '克隆栏目成功',
    'x250112' => '克隆栏目失败',

    /*++++++ x25-2-- 验证 ++++++*/
    'y250201' => '验证通过',
    'x250201' => '输入错误',
    'x250202' => '获取栏目 ID 错误',

    /*++++++ x25-3-- 权限 ++++++*/
    'x250301' => '您没有浏览栏目的权限',
    'x250302' => '您没有创建栏目的权限',
    'x250303' => '您没有编辑栏目的权限',
    'x250304' => '您没有删除栏目的权限',

    /*++++++ x25-4-- 状态 ++++++*/
    'x250401' => '尚未创建栏目',
    'x250404' => '别名已存在',
    'y250405' => '生成栏目成功',
    'x250405' => '生成栏目失败',
    'y250406' => '生成完毕',
    'x250406' => '栏目模板不存在',


    /*@@@@@@ x26---- 来源 @@@@@@*/

    /*++++++ x26-1-- 数据 ++++++*/
    'y260101' => '创建来源成功',
    'x260101' => '创建来源失败',
    'y260102' => '来源存在',
    'x260102' => '来源不存在',
    'y260103' => '更新来源成功',
    'x260103' => '没有做任何修改',
    'y260104' => '删除来源成功',
    'x260104' => '未删除任何来源',
    'y260105' => '创建来源表成功',
    'x260105' => '创建来源表失败',
    'y260106' => '更新来源表成功',
    'x260106' => '没有做任何修改',
    'y260107' => '删除来源表成功',
    'x260107' => '未删除任何表',

    'y260111' => '无需更新来源表',

    /*++++++ x26-2-- 验证 ++++++*/
    'y260201' => '验证通过',
    'x260201' => '输入错误',
    'x260202' => '获取来源 ID 错误',

    /*++++++ x26-3-- 权限 ++++++*/
    'x260301' => '您没有浏览来源的权限',
    'x260302' => '您没有创建来源的权限',
    'x260303' => '您没有编辑来源的权限',
    'x260304' => '您没有删除来源的权限',


    /*@@@@@@ x27---- 采集点 @@@@@@*/

    /*++++++ x27-1-- 数据 ++++++*/
    'y270101' => '创建采集点成功',
    'x270101' => '创建采集点失败',
    'y270102' => '采集点存在',
    'x270102' => '采集点不存在',
    'y270103' => '更新采集点成功',
    'x270103' => '没有做任何修改',
    'y270104' => '删除采集点成功',
    'x270104' => '未删除任何采集点',
    'y270105' => '创建采集点表成功',
    'x270105' => '创建采集点表失败',
    'y270106' => '更新采集点表成功',
    'x270106' => '没有做任何修改',
    'y270107' => '删除采集点表成功',
    'x270107' => '未删除任何表',

    'y270111' => '无需更新采集点表',
    'y270112' => '克隆采集点成功',
    'x270112' => '克隆采集点失败',

    /*++++++ x27-2-- 验证 ++++++*/
    'y270201' => '验证通过',
    'x270201' => '输入错误',
    'x270202' => '获取采集点 ID 错误',

    /*++++++ x27-3-- 权限 ++++++*/
    'x270301' => '您没有浏览采集点的权限',
    'x270302' => '您没有创建采集点的权限',
    'x270303' => '您没有编辑采集点的权限',
    'x270304' => '您没有删除采集点的权限',

    /*++++++ x27-4-- 状态 ++++++*/
    'x270401' => '尚未创建采集点',


    /*@@@@@@ x28---- 采集点 @@@@@@*/

    /*++++++ x28-1-- 数据 ++++++*/
    'y280101' => '采集成功',
    'x280101' => '采集失败',
    'y280102' => '文章已存在',
    'x280102' => '文章不存在',
    'y280103' => '更新采集成功',
    'x280103' => '没有做任何修改',
    'y280104' => '删除采集成功',
    'x280104' => '未删除任何采集',
    'y280105' => '创建采集表成功',
    'x280105' => '创建采集表失败',
    'y280106' => '更新采集表成功',
    'x280106' => '没有做任何修改',
    'y280107' => '删除采集表成功',
    'x280107' => '未删除任何表',

    'y280111' => '无需更新采集表',

    /*++++++ x28-2-- 验证 ++++++*/
    'y280201' => '验证通过',
    'x280201' => '输入错误',
    'x280202' => '获取采集 ID 错误',
    'x280203' => '列表选择器未定义',
    'x280204' => '标题选择器未定义',
    'x280205' => '缺少标题',

    /*++++++ x28-3-- 权限 ++++++*/
    'x280301' => '您没有浏览采集的权限',
    'x280302' => '您没有采集的权限',
    'x280303' => '您没有编辑采集的权限',
    'x280304' => '您没有删除采集的权限',

    /*++++++ x28-4-- 状态 ++++++*/
    'y280401' => '采集完毕',
    'y280402' => '正在入库',
    'x280402' => '已入库',
    'y280403' => '入库成功',
    'x280403' => '入库失败',
    'y280404' => '入库完毕',


    /*@@@@@@ x29---- 相册从属 @@@@@@*/

    /*++++++ x29-1-- 数据 ++++++*/
    'y290101' => '创建相册从属成功',
    'x290101' => '创建相册从属失败',
    'y290102' => '相册从属存在',
    'x290102' => '相册从属不存在',
    'y290103' => '更新相册从属成功',
    'x290103' => '没有做任何修改',
    'y290104' => '删除相册从属成功',
    'x290104' => '未删除任何相册从属',
    'y290105' => '创建相册从属表成功',
    'x290105' => '创建相册从属表失败',
    'y290106' => '更新相册从属表成功',
    'x290106' => '没有做任何修改',
    'y290107' => '删除相册从属表成功',
    'x290107' => '未删除任何表',
    'y290108' => '创建相册视图成功',
    'x290108' => '创建相册视图失败',
    'y290109' => '创建相册从属索引成功',
    'x290109' => '创建相册从属索引失败',
    'y290111' => '无需更新相册从属表',

    /*++++++ x29-2-- 验证 ++++++*/

    /*++++++ x29-3-- 权限 ++++++*/

    /*++++++ x29-3-- 权限 ++++++*/
    'y290407' => '数据清理完毕',
    'x290407' => '正在清理数据',
);
