<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
defined('IN_GINKGO') or exit('Access denied');

/*-------------------------通用-------------------------*/
return array(
    'Access denied'         => '拒绝访问',
    'Article not found'     => '文章不存在',
    'Article is invalid'    => '文章无效',
    'Missing ID'            => '无法获取 ID',
    'Count successful'      => '计数成功',
    'Count failed'          => '计数失败',
);
