<?php
return "<h3>崇尚简单</h3>" .
	"<p>baigo CMS 以简单为设计、开发的宗旨，让使用者轻松的实现建设网站的梦想。安装部署简单、使用简单，只要点点鼠标，简单的几个步骤便能架设起一个网站。baigo CMS 没有复杂的菜单，没有深奥的概念，没有晦涩难懂的名词，一切崇尚简单。</p>" .

	"<h3>开源、免费</h3>" .
	"<p>baigo CMS 是一款开源、免费的网站内容管理系统。baigo Studio 承诺该系统永久免费使用，并永久享受升级服务。</p>" .

	"<h3>便捷的模板功能</h3>" .
	"<p>baigo CMS 采用互联网上使用最为广泛的 Smarty 模板技术，使用任何一款可视化网页制作工具便可轻松设计出 baigo CMS 支持的模板，无需学习复杂的语言。</p>" .

	"<h3>伪静态伪模式</h3>" .
	"<p>baigo CMS 支持传统的动态页面模式、伪静态模式（需服务器相关支持），以便于搜索引擎收录。</p>" .

	"<h3>纯静态页面模式</h3>" .
	"<p>baigo CMS 支持纯静态页面模式（需额外安装模块）。纯静态模式可有效降低服务器负荷，同时也有利于搜索引擎的收录。</p>" .

	"<h3>强大的多站点分发功能</h3>" .
	"<p>baigo CMS 支持多站点分发（需额外安装模块）。图片、附件可以上传到指定的服务器，网站栏目、文章可以分发到指定的服务器，以适用于二级域名的访问。</p>" .

	"<h3>整合单点登录系统</h3>" .
	"<p>baigo CMS 整合了 baigo SSO 单点登录系统。利用 baigo SSO，可以便捷的实现多站点的用户整合，用户可以使用一个账号，便可以全网通行，无需在多个应用之间重复注册、登录。请查看 <a href=\"http://www.baigo.net/Products/baigoSSO/\" target=\"_blank\">baigo SSO 官方网站</a></p>" .

	"<h3>基于最流行的语言开发</h3>" .
	"<p>baigo CMS 是采用 PHP + MySQL 开发的网站内容管理系统。PHP 与 MySQL 可以免费使用，流行广泛，可以运行在 Linux、Windows 或者 Mac 平台，具有良好的通用性。</p>" .

	"<h3>高度模块化</h3>" .
	"<p>baigo CMS 采用 MVC（Model-View-Controller）模式开发，各个模块相对独立，为系统升级提供提供便利，有利于系统的二次开发。</p>";
