<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(
    'str' => array(
        'label'   => '输入框',
    ),
    'radio' => array(
        'label'   => '单选框',
        'option'  => array('选项一', '选项二', '选项三'),
    ),
    'select' => array(
        'label'   => '下拉菜单',
        'option'  => array('选项一', '选项二', '选项三'),
    ),
);
