<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*------提示信息------
x开头为错误
y开头为成功
------------------*/
return array(
    /*@@@@@@ x-1---- 用户 @@@@@@*/

    /*++++++ x-1-1-- 数据 ++++++*/
    'y010101' => '用户注册成功',
    'x010101' => '用户注册失败',
    'y010102' => '用户存在',
    'x010102' => '用户不存在',
    'y010103' => '更新用户成功',
    'x010103' => '没有做任何修改',
    'y010104' => '删除用户成功',
    'x010104' => '未删除任何用户',
    'y010105' => '创建用户表成功',
    'x010105' => '创建用户表失败',
    'y010106' => '更新用户表成功',
    'x010106' => '没有做任何修改',
    'y010107' => '删除用户表成功',
    'x010107' => '未删除任何表',

    'y010108' => '创建用户视图成功',
    'x010108' => '创建用户视图失败',

    'y010111' => '无需更新用户表',

    /*++++++ x-1-2-- 验证 ++++++*/
    'x010201' => '请输入用户名',
    'x010202' => '用户名不能超过 10 中文，30 英文',
    'x010203' => '用户名只能使用中文、英文字母、数字、下划线和连字符',
    'x010204' => '用户名中含有禁止注册的词汇',
    'y010205' => '该用户名可以注册',
    'x010205' => '该用户名已存在',

    'x010206' => '请输入邮箱',
    'x010207' => '邮箱不能超过 300 英文',
    'x010208' => '邮箱格式错误',
    'x010209' => '该邮箱不允许注册',
    'x010210' => '该邮箱禁止注册',
    'y010211' => '该邮箱可以注册',
    'x010211' => '该邮箱已存在',

    'x010212' => '请输入密码',
    'x010213' => '密码错误',

    'x010214' => '昵称不能超过 10 中文，30 英文',
    'x010215' => '备注不能超过 10 中文，30 英文',
    'x010216' => '请选择状态',

    'x010217' => '获取用户 ID 错误',
    'x010218' => '用户 ID 必须为数字',
    'x010219' => '只能上传 CSV 文件',
    'x010220' => '用户名为必须项目', //CSV 导入验证
    'x010221' => '密码为必须项目',
    'x010222' => '请输入新密码',
    'x010223' => '新邮箱与原邮箱一样',
    'x010224' => '请确认密码',
    'x010225' => '两次密码输入不一致',
    'x010226' => '用户已激活',
    'x010227' => '参数错误',
    'x010228' => '获取访问口令错误',
    'x010229' => '访问口令最长 32 位',
    'x010230' => '访问口令错误',
    'x010231' => '访问口令过期',
    'x010232' => '获取刷新口令错误',
    'x010233' => '刷新口令最长 32 位',
    'x010234' => '刷新口令错误',
    'x010235' => '刷新口令过期',

    'x010236' => '密保问题不能超过 100 中文，300 英文',
    'x010237' => '请输入密保答案',
    'x010238' => '请输入密保问题',
    'x010240' => '您没有设置邮箱和密保问题，无法找回密码，请联系系统管理员！',
    'x010241' => '您没有设置邮箱！',
    'x010242' => '您没有设置密保问题！',
    'x010243' => '请输入原密码',
    'x010244' => '原密码错误',
    'x010245' => '密保答案错误',

    /*++++++ x-1-3-- 权限 ++++++*/
    'x010301' => '您没有浏览用户的权限',
    'x010302' => '您没有创建用户的权限',
    'x010303' => '您没有编辑用户的权限',
    'x010304' => '您没有删除用户的权限',
    'x010305' => '您没有批量导入的权限',

    /*++++++ x-1-4-- 状态 ++++++*/
    'y010401' => '用户登录成功',
    'x010401' => '用户被禁用',
    'y010402' => '导入成功',
    'x010402' => '未导入任何数据',
    'y010403' => 'CSV 文件上传成功',
    'x010403' => 'CSV 文件上传失败',
    'y010404' => 'CSV 文件删除成功',
    'x010404' => '未删除任何文件',
    'y010405' => '更换邮箱成功',
    'x010405' => '更换邮箱失败',
    'y010406' => '已将验证邮件发送至新的邮箱，请验证。',
    'x010406' => '更换邮箱失败',
    'y010407' => '修改密码成功',
    'x010407' => '密码未作修改',
    'y010408' => '已将验证邮件发送至您的邮箱，请验证。',
    'x010408' => '找回密码失败',
    'y010409' => '用户激活成功',
    'x010409' => '用户激活失败',
    'y010410' => '已将激活邮件发送至您的邮箱，请验证。',
    'x010410' => '发送激活邮件失败',
    'y010411' => '刷新访问口令成功',
    'x010411' => '刷新访问口令失败',
    'y010412' => '修改密保问题成功',
    'x010412' => '密保问题未作修改',


    /*@@@@@@ x-2---- 管理员 @@@@@@*/

    /*++++++ x-2-1-- 数据 ++++++*/
    'y020101' => '创建管理员成功',
    'x020101' => '创建管理员失败',
    'y020102' => '管理员存在',
    'x020102' => '管理员不存在',
    'y020103' => '更新管理员成功',
    'x020103' => '没有做任何修改',
    'y020104' => '删除管理员成功',
    'x020104' => '未删除任何管理员',
    'y020105' => '创建管理员表成功',
    'x020105' => '创建管理员表失败',
    'y020106' => '更新管理员表成功',
    'x020106' => '没有做任何修改',
    'y020107' => '删除管理员表成功',
    'x020107' => '未删除任何表',
    'y020108' => '更新个人资料成功',
    'x020108' => '禁止更新个人资料',
    'y020109' => '修改密码成功',
    'x020109' => '禁止修改密码',
    'y020111' => '无需更新管理员表',
    'y020112' => '偏好设置成功',
    'x020112' => '禁止更新偏好设置',
    'x020113' => '禁止修改邮箱',
    'x020114' => '禁止修改密保问题',

    /*++++++ x-2-2-- 验证 ++++++*/
    'x020204' => '用户已存在，请使用授权为管理员',
    'x020205' => '用户不存在，请使用创建管理员',
    'x020206' => 'SSO 管理员已存在',

    'x020212' => '备注不能超过 10 中文，30 英文',
    'x020213' => '请选择状态',
    'x020214' => '请选择群组',
    'x020216' => '昵称不能超过 10 中文，30 英文',
    'x020218' => '管理员已存在',
    'x020219' => '请选择类型',

    /*++++++ x-2-3-- 权限 ++++++*/
    'x020301' => '您没有浏览管理员的权限',
    'x020302' => '您没有创建管理员的权限',
    'x020303' => '您没有编辑管理员的权限',
    'x020304' => '您没有删除管理员的权限',
    'x020305' => '您没有加入群组的权限',
    'x020306' => '不能编辑自己',

    /*++++++ x-2-4-- 状态 ++++++*/
    'y020401' => '管理员登录成功',
    'x020401' => '管理员被禁用',
    'x020402' => '管理员尚未登录',
    'x020403' => '登录校验错误',
    'x020404' => '登录超时，请保存好相关信息，重新登录',
    'y020405' => '同步登录成功',
    'y020406' => '同步退出成功',


    /*@@@@@@ x-3---- 系统 @@@@@@*/

    /*++++++ x-3-1-- 数据 ++++++*/
    'y030101' => '创建会话成功',
    'x030101' => '创建会话失败',
    'y030102' => '会话存在',
    'x030102' => '会话不存在',
    'y030103' => '更新会话成功',
    'x030103' => '没有做任何修改',
    'y030104' => '删除会话成功',
    'x030104' => '未删除任何会话',

    'y030105' => '创建会话表成功',
    'x030105' => '创建会话表失败',
    'y030106' => '更新会话表成功',
    'x030106' => '没有做任何修改',
    'y030107' => '删除会话表成功',
    'x030107' => '未删除任何表',

    'y030108' => '创建数据表成功',

    'x030111' => '无法连接数据库服务器',
    'x030112' => '选择的数据库不存在',

    /*++++++ x-3-2-- 验证 ++++++*/
    'x030201' => '请输入 4 位验证码',
    'x030202' => '至少选择一项',
    'x030203' => '请选择具体操作',
    'x030204' => '输入不完整',
    'x030205' => '验证码错误',
    'x030206' => '令牌错误',
    'x030208' => 'SSO 返回错误',
    'x030209' => 'SSO 返回错误',
    'x030211' => 'SSO 版本必须在 2.0 以上',
    'x030213' => 'PHP 版本必须为 5.3.0 以上！',

    /*++++++ x-3-3-- FTP ++++++*/
    'x030301' => 'FTP 服务器连接失败', //创建目录成功
    'x030302' => 'FTP 服务器登录失败', //创建目录失败
    'x030303' => 'FTP 上传文件失败', //创建目录失败
    'x030304' => 'FTP 删除文件失败', //删除文件成功
    'x030305' => 'FTP 创建目录失败', //删除文件失败

    /*++++++ x-3-4-- 状态 ++++++*/
    'x030401' => '正在验证',
    'x030402' => '验证过程出错',
    'x030403' => '系统已安装',
    'y030404' => '数据库设置成功',
    'x030404' => '数据库未正确设置',
    'y030405' => '设置成功',
    'y030408' => 'SSO 设置成功',
    'x030408' => 'SSO 已安装',
    'y030409' => '创建管理员成功',
    'y030410' => '执行自动部署第一步成功',
    'y030411' => '安装成功',
    'y030412' => '升级成功',
    'x030412' => '数据表未正确创建',
    'x030413' => 'SSO 需要执行安装程序',
    'x030414' => 'SSO 需要执行升级程序',
    'x030415' => '需要执行安装程序',
    'x030416' => '需要执行升级程序',
    'x030417' => '服务器环境检查未通过',
    'x030418' => '服务器环境检查未通过',
    'x030419' => 'SSO 数据库未正确设置',
    'x030420' => 'SSO 未正确上传',
    'x030421' => 'SSO 未正确上传',


    /*@@@@@@ x-4---- 群组 @@@@@@*/

    /*++++++ x-4-1-- 数据 ++++++*/
    'y040101' => '创建群组成功',
    'x040101' => '创建群组失败',
    'y040102' => '群组存在',
    'x040102' => '群组不存在',
    'y040103' => '更新群组成功',
    'x040103' => '没有做任何修改',
    'y040104' => '删除群组成功',
    'x040104' => '未删除任何群组',
    'y040105' => '创建群组表成功',
    'x040105' => '创建群组表失败',
    'y040106' => '更新群组表成功',
    'x040106' => '没有做任何修改',
    'y040107' => '删除群组表成功',
    'x040107' => '未删除任何表',
    'y040111' => '无需更新群组表',

    /*++++++ x-4-2-- 验证 ++++++*/
    'x040201' => '请输入组名',
    'x040202' => '组名不能超过 10 中文，30 英文',
    'y040203' => '该组名可以创建',
    'x040203' => '该组名已存在',
    'x040204' => '备注不能超过 10 中文，30 英文',
    'x040205' => '请选择类型',
    'x040206' => '获取群组 ID 错误',
    'x040207' => '请选择状态',

    /*++++++ x-4-3-- 权限 ++++++*/
    'x040301' => '您没有浏览群组的权限',
    'x040302' => '您没有创建群组的权限',
    'x040303' => '您没有编辑群组的权限',
    'x040304' => '您没有删除群组的权限',

    /*++++++ x-4-3-- 权限 ++++++*/
    'x040401' => '群组被禁用',


    /*@@@@@@ x-5---- 应用 @@@@@@*/

    /*++++++ x-5-1-- 数据 ++++++*/
    'y050102' => '应用存在',
    'x050102' => '应用不存在',

    /*++++++ x-5-2-- 验证 ++++++*/
    'x050203' => '获取应用 ID 错误',
    'x050204' => '应用 ID 必须为数字',

    'x050212' => '不允许访问的 IP 地址',
    'x050213' => '禁止访问的 IP 地址',

    'x050214' => '无通信密钥',
    'x050215' => '通信密钥最长 32 位',
    'x050216' => '通信密钥只能使用英文字母和数字',
    'x050217' => '通信密钥错误',

    'x050218' => '请选择是否同步',

    'x050222' => '无待加密数据',
    'x050223' => '无待解密数据',
    'x050224' => '无时间戳',
    'x050225' => '时间戳格式错误',
    'x050226' => '无签名',
    'x050227' => '时差超过 30 分钟',

    /*++++++ x-5-3-- 权限 ++++++*/
    'x050305' => '本应用没有用户注册权限',
    'x050306' => '本应用没有用户登录权限',
    'x050307' => '本应用没有获取用户信息权限',
    'x050308' => '本应用没有编辑用户权限',
    'x050309' => '本应用没有删除用户权限',
    'x050310' => '本应用没有验证用户名权限',
    'x050311' => '本应用没有验证邮箱权限',
    'x050312' => '本应用没有生成签名权限',
    'x050313' => '本应用没有验证签名权限',
    'x050314' => '本应用没有加密权限',
    'x050315' => '本应用没有解密权限',
    'x050316' => '系统禁止注册',
    'x050317' => '本应用没有检查新短消息权限',
    'x050318' => '本应用没有读取短消息权限',
    'x050319' => '本应用没有列出短消息权限',
    'x050322' => '本应用没有撤回短信权限',

    /*++++++ x-5-4-- 状态 ++++++*/
    'x050402' => '应用被禁用',
    'y050403' => '签名正确',
    'x050403' => '签名错误',
    'y050404' => '生成签名成功',
    'y050405' => '加密成功',
    'y050406' => '解密成功',



    /*@@@@@@ x-6---- 设置 @@@@@@*/

    /*++++++ x-6-1-- 数据 ++++++*/
    'y060101' => '创建设置项成功',
    'x060101' => '创建设置项失败',

    /*++++++ x-6-2-- 验证 ++++++*/
    'x060201' => '请输入',
    'x060202' => '不能超过 300 中文，900 英文',
    'x060203' => '格式错误',
    'x060204' => '请输入数据库地址',
    'x060205' => '地址不能超过 300 中文，900 英文',
    'x060206' => '请输入数据库名称',
    'x060207' => '名称不能超过 300 中文，900 英文',
    'x060208' => '请输入数据库端口',
    'x060209' => '端口不能超过 300 中文，900 英文',
    'x060210' => '请输入数据库用户名',
    'x060211' => '用户名不能超过 300 中文，900 英文',
    'x060212' => '请输入数据库密码',
    'x060213' => '密码不能超过 300 中文，900 英文',
    'x060214' => '请输入数据库编码',
    'x060215' => '编码不能超过 300 中文，900 英文',
    'x060216' => '请输入数据表前缀',
    'x060217' => '前缀不能超过 300 中文，900 英文',

    /*++++++ x-6-3-- 权限 ++++++*/
    'x060301' => '您没有设置的权限',

    /*++++++ x-6-4-- 状态 ++++++*/
    'y060401' => '设置成功',
    'y060402' => '检查更新成功',



    /*@@@@@@ x-7---- 附件数据 @@@@@@*/

    /*++++++ x-7-1-- 数据 ++++++*/
    'y070101' => '创建附件数据成功',
    'x070101' => '创建附件数据失败',
    'y070102' => '附件数据存在',
    'x070102' => '附件数据不存在',
    'y070103' => '更新附件数据成功',
    'x070103' => '没有做任何修改',
    'y070104' => '删除附件数据成功',
    'x070104' => '未删除任何附件数据',

    'y070105' => '创建附件表成功',
    'x070105' => '创建附件表失败',
    'y070106' => '更新附件表成功',
    'x070106' => '没有做任何修改',
    'y070107' => '删除附件表成功',
    'x070107' => '未删除任何表',

    'y070111' => '无需更新附件表',
    'y070112' => '附件表更名成功',
    'y070113' => '附件表无需更名',

    /*++++++ x-7-2-- 验证 ++++++*/
    'x070201' => '请选择要上传的文件',
    'x070202' => '不允许上传的类型',
    'x070203' => '上传文件不能超过',
    'x070204' => '同时上传不能超过',
    'x070205' => '请选择状态',
    'x070206' => '上传校验错误',
    'x070207' => 'MIME 校验错误',

    /*++++++ x-7-3-- 权限 ++++++*/
    'x070301' => '您没有浏览附件的权限',
    'x070302' => '您没有上传的权限',
    'x070303' => '您没有编辑附件的权限',
    'x070304' => '您没有删除附件的权限',

    /*++++++ x-6-4-- 状态 ++++++*/
    'y070401' => '上传成功',
    'y070402' => '生成缩略图成功',
    'x070402' => '未生成缩略图',
    'y070403' => '上传初始化成功',
    'y070404' => '插入图片成功',
    'x070405' => '尚未设置允许上传类型',
    'y070406' => '此附件被使用',
    'x070406' => '此附件未使用',
    'y070407' => '附件清理完毕',
    'x070407' => '正在清理附件',
    'y070408' => '回收站清空完毕',
    'x070408' => '正在清空回收站',
    'y070409' => '重新生成缩略图完毕',
    'x070409' => '正在重新生成缩略图',



    /*@@@@@@ x-8---- 上传类型 @@@@@@*/

    /*++++++ x-8-1-- 数据 ++++++*/
    'y080101' => '创建 MIME 成功',
    'x080101' => '创建 MIME 失败',
    'y080102' => 'MIME 存在',
    'x080102' => 'MIME 不存在',
    'y080103' => '更新 MIME 成功',
    'x080103' => '没有做任何修改',
    'y080104' => '删除 MIME 成功',
    'x080104' => '未删除任何 MIME',
    'y080105' => '创建 MIME 表成功',
    'x080105' => '创建 MIME 表失败',
    'y080106' => '更新 MIME 表成功',
    'x080106' => '没有做任何修改',
    'y080107' => '删除 MIME 表成功',
    'x080107' => '未删除任何表',
    'y080111' => '无需更新 MIME 表',

    /*++++++ x-8-2-- 验证 ++++++*/
    'x080201' => '请输入 MIME',
    'x080202' => 'MIME 不能超过 900 字符',
    'x080203' => '请输入扩展名',
    'x080204' => '扩展名不能超过 30 字符',
    'x080205' => '备注不能超过 100 中文，300 英文',
    'x080206' => '该类型已存在',

    /*++++++ x-8-3-- 权限 ++++++*/
    'x080301' => '您没有浏览 MIME 的权限',
    'x080302' => '您没有创建 MIME 的权限',
    'x080303' => '您没有编辑 MIME 的权限',
    'x080304' => '您没有删除 MIME 的权限',

    /*++++++ x-8-4-- 状态 ++++++*/



    /*@@@@@@ x-9---- 缩略图 @@@@@@*/

    /*++++++ x-9-1-- 数据 ++++++*/
    'y090101' => '创建缩略图成功',
    'x090101' => '创建缩略图失败',
    'y090102' => '缩略图存在',
    'x090102' => '缩略图不存在',
    'y090103' => '更新缩略图成功',
    'x090103' => '没有做任何修改',
    'y090104' => '删除缩略图成功',
    'x090104' => '未删除任何缩略图',

    'y090105' => '创建缩略图表成功',
    'x090105' => '创建缩略图表失败',
    'y090106' => '更新缩略图表成功',
    'x090106' => '没有做任何修改',
    'y090107' => '删除缩略图表成功',
    'x090107' => '未删除任何表',

    'y090110' => '更新缩略图缓存成功',
    'x090110' => '更新缩略图缓存失败',
    'y090111' => '无需更新缩略图表',

    /*++++++ x-9-2-- 验证 ++++++*/
    'x090201' => '请输入最大宽度',
    'x090202' => '宽度必须为数字',
    'x090203' => '请输入最大高度',
    'x090204' => '高度必须为数字',
    'x090205' => '请选择缩略图类型',
    'x090206' => '该缩略图已存在',
    'x090207' => '获取缩略图 ID 错误',

    /*++++++ x-9-3-- 权限 ++++++*/
    'x090301' => '您没有浏览缩略图的权限',
    'x090302' => '您没有创建缩略图的权限',
    'x090303' => '您没有编辑缩略图的权限',
    'x090304' => '您没有删除缩略图的权限',

    /*++++++ x-9-4-- 状态 ++++++*/



    /*@@@@@@ x10---- 目录 @@@@@@*/

    /*++++++ x10-1-- 目录 ++++++*/
    'y100101' => '创建目录成功',
    'x100101' => '创建目录失败',
    'y100102' => '目录存在',
    'x100102' => '目录不存在',
    'y100103' => '更新目录成功',
    'x100103' => '没有做任何修改',
    'y100104' => '删除目录成功',
    'x100104' => '未删除任何目录',

    /*++++++ x10-2-- php 上传处理 ++++++*/
    'x100201' => '上传的文件超过了 php.ini 的设置', //上传的文件超过了 php.ini 中的设置
    'x100202' => '上传文件的大小超过了表单的设置', //上传文件的大小超过了表单的设置
    'x100203' => '文件只有部分被上传', //文件只有部分被上传
    'x100204' => '没有文件被上传', //没有文件被上传
    'x100206' => '找不到临时目录', //找不到临时目录
    'x100207' => '文件写入失败', //找不到临时目录


    /*@@@@@@ x11---- 短信 @@@@@@*/

    /*++++++ x11-1-- 数据 ++++++*/
    'y110101' => '发送短信成功',
    'x110101' => '发送短信失败',
    'y110102' => '短信存在',
    'x110102' => '短信不存在',
    'y110103' => '更新短信成功',
    'x110103' => '没有做任何修改',
    'y110104' => '删除短信成功',
    'x110104' => '未删除任何短信',

    'y110109' => '撤回短信成功',
    'x110109' => '未撤回任何短信',

    /*++++++ x11-2-- 验证 ++++++*/
    'x110201' => '请输入短信内容',
    'x110202' => '标题不能超过 30 中文，90 英文',
    'x110203' => '内容不能超过 300 中文，900 英文',
    'x110204' => '请选择群发方式',
    'x110205' => '请输入收件人',
    'x110206' => '请输入关键词',
    'x110207' => '请输入关键词',
    'x110208' => '请输入起始用户 ID',
    'x110209' => '用户 ID 只能为数字',
    'x110210' => '请输入结束用户 ID',
    'x110211' => '获取短信 ID 错误',
    'x110212' => '请输入起始时间',
    'x110213' => '时间格式错误',
    'x110214' => '请输入结束时间',
    'x110215' => '请输入起始时间',
    'x110216' => '时间格式错误',
    'x110217' => '请输入结束时间',
    'x110218' => '请输入短信类型',
    'x110219' => '请输入短信状态',

    /*++++++ x11-3-- 权限 ++++++*/

    /*++++++ x11-4-- 权限 ++++++*/
    'y110401' => '您有未读短信',
    'x110401' => '您没有未读短信',
    'y110402' => '列出短信成功',
    'x110403' => '该短信不属于您',


    /*@@@@@@ x12---- 文章 @@@@@@*/

    /*++++++ x12-1-- 数据 ++++++*/
    'y120101' => '创建文章成功',
    'x120101' => '创建文章失败',
    'y120102' => '文章存在',
    'x120102' => '文章不存在',
    'y120103' => '更新文章成功',
    'x120103' => '没有做任何修改',
    'y120104' => '删除文章成功',
    'x120104' => '未删除任何文章',
    'y120105' => '创建文章表成功',
    'x120105' => '创建文章表失败',
    'y120106' => '更新文章表成功',
    'x120106' => '没有做任何修改',
    'y120107' => '删除文章表成功',
    'x120107' => '未删除任何表',
    'y120109' => '创建文章索引成功',
    'x120109' => '创建文章索引失败',

    'y120111' => '创建文章内容表成功',
    'x120111' => '创建文章内容表失败',
    'y120112' => '复制文章内容表成功',
    'x120112' => '复制文章内容表失败',
    'y120113' => '更新文章内容表成功',
    'x120113' => '未更新文章内容表',
    'y120114' => '无需复制文章内容表',
    'y120115' => '无需更新文章内容表',
    'y120116' => '无需更新文章表',
    'x120117' => '创建文章内容失败',


    /*++++++ x12-2-- 验证 ++++++*/
    'x120201' => '请输入文章标题',
    'x120202' => '文章标题不能超过 100 中文，300 英文',
    'x120203' => 'TAG 不能超过 100 中文，300 英文',
    'x120204' => '链接不能超过 900 字符',
    'x120205' => '链接格式错误',
    'x120206' => '摘要不能超过 300 中文，900 英文',
    'x120207' => '请选择隶属于栏目',
    'x120208' => '请选择状态',
    'x120209' => '请选择保存至',
    'x120210' => '请输入上线时间',
    'x120211' => '时间格式错误',
    'x120212' => '获取文章 ID 错误',
    'x120213' => '该文章为跳转',
    'x120214' => '请选择附件',
    'x120215' => 'TAG 只能为中文、数字与下划线',
    'x120216' => '请输入',
    'x120217' => '不能超过 100 中文，300 英文',
    'x120218' => '请选择',
    'x120219' => '请输入下线时间',
    'x120220' => '时间格式错误',
    'x120221' => '请输入显示时间',
    'x120222' => '时间格式错误',
    'x120223' => '请勿重复提交',

    /*++++++ x12-3-- 权限 ++++++*/
    'x120301' => '您没有浏览文章的权限',
    'x120302' => '您没有创建文章的权限',
    'x120303' => '您没有编辑文章的权限',
    'x120304' => '您没有删除文章的权限',

    /*++++++ x12-4-- 状态 ++++++*/
    'y120402' => '正在生成文章',
    'x120402' => '该文章已生成',
    'y120403' => '生成文章成功',
    'x120403' => '生成文章失败',
    'x120404' => '该文章暂时无法生成',
    'y120405' => '计数成功',
    'y120406' => '生成完毕',



    /*@@@@@@ x13---- TAG @@@@@@*/

    /*++++++ x13-1-- 数据 ++++++*/
    'y130101' => '创建 TAG 成功',
    'x130101' => '创建 TAG 失败',
    'y130102' => 'TAG 存在',
    'x130102' => 'TAG 不存在',
    'y130103' => '更新 TAG 成功',
    'x130103' => '没有做任何修改',
    'y130104' => '删除 TAG 成功',
    'x130104' => '未删除任何 TAG',
    'y130105' => '创建 TAG 表成功',
    'x130105' => '创建 TAG 表失败',
    'y130106' => '更新 TAG 表成功',
    'x130106' => '没有做任何修改',
    'y130107' => '删除 TAG 表成功',
    'x130107' => '未删除任何表',
    'y130109' => '创建 TAG 索引成功',
    'x130109' => '创建 TAG 索引失败',
    'y130111' => '无需更新 TAG 表',

    /*++++++ x13-2-- 验证 ++++++*/
    'x130201' => '请输入 TAG',
    'x130202' => 'TAG 不能超过 10 中文，30 英文',
    'x130203' => 'TAG 已存在',
    'x130204' => '请选择 TAG 状态',

    /*++++++ x13-3-- 权限 ++++++*/
    'x130301' => '您没有浏览 TAG 的权限',
    'x130302' => '您没有创建 TAG 的权限',
    'x130303' => '您没有编辑 TAG 的权限',
    'x130304' => '您没有删除 TAG 的权限',



    /*@@@@@@ x14---- 标记 @@@@@@*/

    /*++++++ x14-1-- 数据 ++++++*/
    'y140101' => '创建标记成功',
    'x140101' => '创建标记失败',
    'y140102' => '标记存在',
    'x140102' => '标记不存在',
    'y140103' => '更新标记成功',
    'x140103' => '没有做任何修改',
    'y140104' => '删除标记成功',
    'x140104' => '未删除任何标记',
    'y140105' => '创建标记表成功',
    'x140105' => '创建标记表失败',
    'y140106' => '更新标记表成功',
    'x140106' => '没有做任何修改',
    'y140107' => '删除标记表成功',
    'x140107' => '未删除任何表',
    'y140111' => '无需更新标记表',

    /*++++++ x14-2-- 验证 ++++++*/
    'x140201' => '请输入标记',
    'x140202' => '标记不能超过 10 中文，30 英文',
    'x140203' => '标记已存在',
    'x140204' => '请选择标记状态',

    /*++++++ x14-3-- 权限 ++++++*/
    'x140301' => '您没有浏览标记的权限',
    'x140302' => '您没有创建标记的权限',
    'x140303' => '您没有编辑标记的权限',
    'x140304' => '您没有删除标记的权限',



    /*@@@@@@ x15---- 栏目从属 @@@@@@*/

    /*++++++ x15-1-- 数据 ++++++*/
    'y150101' => '创建栏目从属成功',
    'x150101' => '创建栏目从属失败',
    'y150102' => '栏目从属存在',
    'x150102' => '栏目从属不存在',
    'y150103' => '更新栏目从属成功',
    'x150103' => '没有做任何修改',
    'y150104' => '删除栏目从属成功',
    'x150104' => '未删除任何栏目从属',
    'y150105' => '创建栏目从属表成功',
    'x150105' => '创建栏目从属表失败',
    'y150106' => '更新栏目从属表成功',
    'x150106' => '没有做任何修改',
    'y150107' => '删除栏目从属表成功',
    'x150107' => '未删除任何表',
    'y150108' => '创建栏目视图成功',
    'x150108' => '创建栏目视图失败',
    'y150109' => '创建栏目从属索引成功',
    'x150109' => '创建栏目从属索引失败',
    'y150111' => '无需更新栏目从属表',


    /*@@@@@@ x16---- TAG 从属 @@@@@@*/

    /*++++++ x16-1-- 数据 ++++++*/
    'y160101' => '创建 TAG 从属成功',
    'x160101' => '创建 TAG 从属失败',
    'y160102' => 'TAG 从属存在',
    'x160102' => 'TAG 从属不存在',
    'y160103' => '更新 TAG 从属成功',
    'x160103' => '没有做任何修改',
    'y160104' => '删除 TAG 从属成功',
    'x160104' => '未删除任何 TAG 从属',
    'y160105' => '创建 TAG 从属表成功',
    'x160105' => '创建 TAG 从属表失败',
    'y160106' => '更新 TAG 从属表成功',
    'x160106' => '没有做任何修改',
    'y160107' => '删除 TAG 从属表成功',
    'x160107' => '未删除任何表',
    'y160108' => '创建 TAG 视图成功',
    'x160108' => '创建 TAG 视图失败',
    'y160109' => '创建 TAG 从属索引成功',
    'x160109' => '创建 TAG 从属索引失败',



    /*@@@@@@ x17---- 调用 @@@@@@*/

    /*++++++ x17-1-- 数据 ++++++*/
    'y170101' => '创建调用成功',
    'x170101' => '创建调用失败',
    'y170102' => '调用存在',
    'x170102' => '调用不存在',
    'y170103' => '更新调用成功',
    'x170103' => '没有做任何修改',
    'y170104' => '删除调用成功',
    'x170104' => '未删除任何调用',
    'y170105' => '创建调用表成功',
    'x170105' => '创建调用表失败',
    'y170106' => '更新调用表成功',
    'x170106' => '没有做任何修改',
    'y170107' => '删除调用表成功',
    'x170107' => '未删除任何表',

    'y170111' => '无需更新调用表',

    'y170112' => '克隆调用成功',
    'x170112' => '克隆调用失败',

    /*++++++ x17-2-- 验证 ++++++*/
    'x170201' => '请输入调用名称',
    'x170202' => '调用名称不能超过 100 中文，300 英文',
    'x170203' => '调用名称已存在',
    'x170204' => '请选择调用类型',
    'x170205' => '请选择生成文件类型',
    'x170206' => '请选择状态',
    'x170207' => '请输入显示数',
    'x170208' => '必须为数字',
    'x170209' => '请输入排除数',
    'x170210' => '必须为数字',
    'x170213' => '获取调用 ID 错误',
    'x170214' => '不能超过 300 字符',
    'x170215' => '只能使用英文、数字、下划线与减号',
    'x170216' => '至少选择一项',
    'x170217' => '请选择模板',

    /*++++++ x17-3-- 权限 ++++++*/
    'x170301' => '您没有浏览调用的权限',
    'x170302' => '您没有创建调用的权限',
    'x170303' => '您没有编辑调用的权限',
    'x170304' => '您没有删除调用的权限',

    /*++++++ x17-4-- 状态 ++++++*/
    'y170402' => '正在生成调用',
    'y170403' => '生成调用成功',
    'x170404' => '该调用暂时无法生成',


    /*@@@@@@ x18---- 专题 @@@@@@*/

    /*++++++ x18-1-- 数据 ++++++*/
    'y180101' => '创建专题成功',
    'x180101' => '创建专题失败',
    'y180102' => '专题存在',
    'x180102' => '专题不存在',
    'y180103' => '更新专题成功',
    'x180103' => '没有做任何修改',
    'y180104' => '删除专题成功',
    'x180104' => '未删除任何专题',
    'y180105' => '创建专题表成功',
    'x180105' => '创建专题表失败',
    'y180106' => '更新专题表成功',
    'x180106' => '没有做任何修改',
    'y180107' => '删除专题表成功',
    'x180107' => '未删除任何表',
    'y180111' => '无需更新专题表',

    /*++++++ x18-2-- 验证 ++++++*/
    'x180201' => '请输入专题名称',
    'x180202' => '专题名称不能超过 100 中文，300 英文',
    'x180203' => '专题内容不能超过 1000 中文，3000 英文',
    'x180204' => '获取专题 ID 出错',
    'x180205' => '请选择状态',
    'x180206' => '请选择附件',

    /*++++++ x18-3-- 权限 ++++++*/
    'x180301' => '您没有浏览专题的权限',
    'x180302' => '您没有创建专题的权限',
    'x180303' => '您没有编辑专题的权限',
    'x180304' => '您没有删除专题的权限',

    /*++++++ x18-3-- 状态 ++++++*/
    'y180402' => '正在生成专题',
    'y180403' => '生成专题成功',
    'x180403' => '生成专题失败',
    'x180404' => '该专题暂时无法生成',
    'x180405' => '加入专题失败',
    'y180405' => '加入专题成功',
    'x180406' => '移出专题失败',
    'y180406' => '移出专题成功',


    /*@@@@@@ x19---- 应用 @@@@@@*/

    /*++++++ x19-1-- 数据 ++++++*/
    'y190101' => '创建应用成功',
    'x190101' => '创建应用失败',
    'y190102' => '应用存在',
    'x190102' => '应用不存在',
    'y190103' => '更新应用成功',
    'x190103' => '没有做任何修改',
    'y190104' => '删除应用成功',
    'x190104' => '未删除任何应用',
    'y190105' => '创建应用表成功',
    'x190105' => '创建应用表失败',
    'y190106' => '更新应用表成功',
    'x190106' => '没有做任何修改',
    'y190107' => '删除应用表成功',
    'x190107' => '未删除任何表',
    'y190111' => '无需更新应用表',

    /*++++++ x19-2-- 验证 ++++++*/
    'x190201' => '请输入应用名称',
    'x190202' => '应用名称不能超过 10 中文，30 英文',
    'x190203' => '获取应用 ID 错误',
    'x190204' => '应用 ID 必须为数字',

    'x190205' => '备注不能超过 10 中文，30 英文',
    'x190206' => '请选择状态',

    'x190207' => '请输入通知接口 URL',
    'x190208' => '通知接口 URL 不能超过 3000 字符',
    'x190209' => '通知接口 URL 格式错误',

    'x190210' => '允许 IP 地址最长不能超过 3000 英文',
    'x190211' => '禁止 IP 地址最长不能超过 3000 英文',
    'x190212' => '不允许访问的 IP 地址',
    'x190213' => '禁止访问的 IP 地址',

    'x190214' => '无通信密钥',
    'x190215' => '通信密钥最长 32 位',
    'x190216' => '通信密钥格式错误',
    'x190217' => '通信密钥错误',

    'x190218' => '请选择是否同步',

    /*++++++ x19-3-- 权限 ++++++*/
    'x190301' => '您没有浏览应用的权限',
    'x190302' => '您没有创建应用的权限',
    'x190303' => '您没有编辑应用的权限',
    'x190304' => '您没有删除应用的权限',

    'x190305' => '本应用没有用户注册权限',
    'x190306' => '本应用没有用户登录权限',
    'x190307' => '本应用没有获取用户信息权限',
    'x190308' => '本应用没有编辑用户权限',
    'x190309' => '本应用没有删除用户权限',
    'x190310' => '本应用没有验证用户名权限',
    'x190311' => '本应用没有验证 E-mail 权限',
    'x190312' => '本应用没有生成签名权限',
    'x190313' => '本应用没有验证签名权限',
    'x190314' => '本应用没有加密权限',
    'x190315' => '本应用没有解密权限',

    /*++++++ x19-4-- 状态 ++++++*/
    'x190402' => '应用被禁用',



    /*@@@@@@ x20---- 自定义字段 @@@@@@*/

    /*++++++ x20-1-- 数据 ++++++*/
    'y200101' => '创建自定义字段成功',
    'x200101' => '创建自定义字段失败',
    'y200102' => '自定义字段存在',
    'x200102' => '自定义字段不存在',
    'y200103' => '更新自定义字段成功',
    'x200103' => '没有做任何修改',
    'y200104' => '删除自定义字段成功',
    'x200104' => '未删除任何自定义字段',
    'y200105' => '创建自定义字段表成功',
    'x200105' => '创建自定义字段表失败',
    'y200106' => '更新自定义字段表成功',
    'x200106' => '没有做任何修改',
    'y200107' => '删除自定义字段表成功',
    'x200107' => '未删除任何表',

    'y200109' => '创建自定义字段索引成功',
    'x200109' => '创建自定义字段索引失败',
    'y200110' => '更新自定义字段缓存成功',
    'x200110' => '创建自定义字段缓存失败',
    'y200115' => '无需更新自定义字段表',

    /*++++++ x20-2-- 验证 ++++++*/
    'x200201' => '请输入字段名称',
    'x200202' => '字段名称不能超过 30 中文，90 英文',
    'x200203' => '字段已存在',
    'x200204' => '字段 ID 必须为数字',
    'x200205' => '请选择字段格式',
    'x200206' => '请选择字段状态',
    'x200207' => '请选择隶属字段',
    'x200208' => '不能隶属于本字段',
    'x200209' => '获取字段 ID 错误',
    'x200210' => '请选择排序方式',
    'x200211' => '请选择字段类型',
    'x200212' => '字段选项不能超过 900 字符',
    'x200213' => '请选择隶属栏目',
    'x200214' => '获取字段 ID 错误',
    'x200215' => '输入的 ID 错误',

    /*++++++ x20-3-- 权限 ++++++*/
    'x200301' => '您没有浏览自定义字段的权限',
    'x200302' => '您没有创建自定义字段的权限',
    'x200303' => '您没有编辑自定义字段的权限',
    'x200304' => '您没有删除自定义字段的权限',

    /*++++++ x20-4-- 状态 ++++++*/
    'x200402' => '自定义字段被禁用',


    /*@@@@@@ x21---- 自定义字段从属 @@@@@@*/

    /*++++++ x21-1-- 数据 ++++++*/
    'y210101' => '创建自定义字段值表成功',
    'x210101' => '创建自定义字段值表失败',
    'y210102' => '自定义字段值表存在',
    'x210102' => '自定义字段值表不存在',
    'y210103' => '更新自定义字段值表成功',
    'x210103' => '没有做任何修改',
    'y210104' => '删除自定义字段值表成功',
    'x210104' => '未删除任何自定义字段值表',
    'y210105' => '创建自定义字段值表表成功',
    'x210105' => '创建自定义字段值表表失败',
    'y210106' => '更新自定义字段值表表成功',
    'x210106' => '没有做任何修改',
    'y210107' => '删除自定义字段值表表成功',
    'x210107' => '未删除任何表',
    'y210108' => '创建自定义字段视图成功',
    'x210108' => '创建自定义字段视图失败',
    'y210109' => '创建自定义字段值表索引成功',
    'x210109' => '创建自定义字段值表索引失败',


    /*@@@@@@ x22---- 通知 @@@@@@*/

    /*++++++ x22-2-- 验证 ++++++*/
    'x220201' => '无时间戳',
    'x220202' => '无随机字符串',
    'x220203' => '无签名',
    'x220204' => '无待解密数据',
    'x220206' => '获取应用 ID 错误',
    'x220207' => '应用 ID 必须为数字',
    'x220208' => '应用 ID 错误',
    'x220209' => '无通信密钥',
    'x220210' => '通信密钥最长 32 位',
    'x220211' => '通信密钥格式错误',
    'x220212' => '通信密钥错误',
    'x220213' => '时间戳失效',


    /*@@@@@@ x23---- 专题 从属 @@@@@@*/

    /*++++++ x23-1-- 数据 ++++++*/
    'y230101' => '创建专题从属成功',
    'x230101' => '创建专题从属失败',
    'y230102' => '专题从属存在',
    'x230102' => '专题从属不存在',
    'y230103' => '更新专题从属成功',
    'x230103' => '没有做任何修改',
    'y230104' => '删除专题从属成功',
    'x230104' => '未删除任何专题从属',
    'y230105' => '创建专题从属表成功',
    'x230105' => '创建专题从属表失败',
    'y230106' => '更新专题从属表成功',
    'x230106' => '没有做任何修改',
    'y230107' => '删除专题从属表成功',
    'x230107' => '未删除任何表',
    'y230108' => '创建专题视图成功',
    'x230108' => '创建专题视图失败',
    'y230109' => '创建专题从属索引成功',
    'x230109' => '创建专题从属索引失败',


    /*@@@@@@ x24---- 链接 @@@@@@*/

    /*++++++ x24-1-- 数据 ++++++*/
    'y240101' => '创建链接成功',
    'x240101' => '创建链接失败',
    'y240102' => '链接存在',
    'x240102' => '链接不存在',
    'y240103' => '更新链接成功',
    'x240103' => '没有做任何修改',
    'y240104' => '删除链接成功',
    'x240104' => '未删除任何链接',
    'y240105' => '创建链接表成功',
    'x240105' => '创建链接表失败',
    'y240106' => '更新链接表成功',
    'x240106' => '没有做任何修改',
    'y240107' => '删除链接表成功',
    'x240107' => '未删除任何表',
    'y240111' => '无需更新链接表',
    'y240112' => '更新链接缓存成功',

    /*++++++ x24-2-- 验证 ++++++*/
    'x240201' => '请输入链接名称',
    'x240202' => '链接名称不能超过 100 中文，300 英文',
    'x240203' => '请输入链接地址',
    'x240204' => '链接地址不能超过 300 中文，900 英文',
    'x240205' => '链接地址格式错误',
    'x240206' => '请选择链接类型',
    'x240207' => '请选择链接状态',
    'x240208' => '请选择隶属栏目',
    'x240209' => '获取链接 ID 错误',
    'x240210' => '请选择是否在新窗口中打开',
    'x240211' => '获取链接 ID 错误',
    'x240212' => '输入的 ID 错误',
    'x240213' => '请选择排序方式',

    /*++++++ x24-3-- 权限 ++++++*/
    'x240301' => '您没有浏览链接的权限',
    'x240302' => '您没有创建链接的权限',
    'x240303' => '您没有编辑链接的权限',
    'x240304' => '您没有删除链接的权限',


    /*@@@@@@ x25---- 栏目 @@@@@@*/

    /*++++++ x25-1-- 数据 ++++++*/
    'y250101' => '创建栏目成功',
    'x250101' => '创建栏目失败',
    'y250102' => '栏目存在',
    'x250102' => '栏目不存在',
    'y250103' => '更新栏目成功',
    'x250103' => '没有做任何修改',
    'y250104' => '删除栏目成功',
    'x250104' => '未删除任何栏目',
    'y250105' => '创建栏目表成功',
    'x250105' => '创建栏目表失败',
    'y250106' => '更新栏目表成功',
    'x250106' => '没有做任何修改',
    'y250107' => '删除栏目表成功',
    'x250107' => '未删除任何表',

    'y250109' => '创建栏目索引成功',
    'x250109' => '创建栏目索引失败',

    'y250110' => '更新栏目缓存成功',
    'x250110' => '创建栏目缓存失败',
    'y250111' => '无需更新栏目表',

    'y250112' => '克隆栏目成功',
    'x250112' => '克隆栏目失败',

    /*++++++ x25-2-- 验证 ++++++*/
    'x250201' => '请输入栏目名称',
    'x250202' => '栏目名称不能超过 100 中文，300 英文',
    'x250203' => '栏目名称已存在',
    'x250204' => '栏目别名不能超过 300 字符',
    'x250205' => '栏目别名只能使用英文字母、数字、下划线和连字符',
    'x250206' => '栏目别名已存在',
    'x250207' => 'URL 前缀不能超过 3000 字符',
    'x250208' => 'URL 前缀格式错误',
    'x250209' => '请输入栏目介绍',
    'x250210' => '请输入跳转至',
    'x250211' => '跳转至不能超过 300 字符',
    'x250212' => '跳转至格式错误',
    'x250213' => '请选择隶属栏目',
    'x250214' => '请选择栏目模板',
    'x250215' => '请选择栏目类型',
    'x250216' => '请选择栏目状态',
    'x250217' => '获取栏目 ID 错误',
    'x250218' => '该栏目为跳转',
    'x250219' => '请选择排序方式',
    'x250220' => '输入的 ID 错误',
    'x250221' => '不能隶属于本栏目',
    'x250222' => '只能选择普通栏目',
    'x250223' => '请输入每页显示数',
    'x250224' => '每页显示数必须为数字',
    'x250225' => '请选择目标栏目',

    /*++++++ x25-3-- 权限 ++++++*/
    'x250301' => '您没有浏览栏目的权限',
    'x250302' => '您没有创建栏目的权限',
    'x250303' => '您没有编辑栏目的权限',
    'x250304' => '您没有删除栏目的权限',

    /*++++++ x25-4-- 状态 ++++++*/
    'x250401' => '尚未创建栏目',
    'y250402' => '正在生成栏目',
    'y250403' => '生成栏目成功',
    'x250403' => '生成栏目失败',
    'x250404' => '该栏目暂时无法生成',


    /*@@@@@@ x26---- 来源 @@@@@@*/

    /*++++++ x26-1-- 数据 ++++++*/
    'y260101' => '创建来源成功',
    'x260101' => '创建来源失败',
    'y260102' => '来源存在',
    'x260102' => '来源不存在',
    'y260103' => '更新来源成功',
    'x260103' => '没有做任何修改',
    'y260104' => '删除来源成功',
    'x260104' => '未删除任何来源',
    'y260105' => '创建来源表成功',
    'x260105' => '创建来源表失败',
    'y260106' => '更新来源表成功',
    'x260106' => '没有做任何修改',
    'y260107' => '删除来源表成功',
    'x260107' => '未删除任何表',

    'y260111' => '无需更新来源表',

    /*++++++ x26-2-- 验证 ++++++*/
    'x260201' => '请输入来源名称',
    'x260202' => '来源名称不能超过 100 中文，300 英文',
    'x260203' => '作者不能超过 100 中文，300 英文',
    'x260204' => '来源 URL 不能超过 900 字符',
    'x260205' => '备注不能超过 10 中文，30 英文',

    /*++++++ x26-3-- 权限 ++++++*/
    'x260301' => '您没有浏览来源的权限',
    'x260302' => '您没有创建来源的权限',
    'x260303' => '您没有编辑来源的权限',
    'x260304' => '您没有删除来源的权限',



    /*@@@@@@ x27---- 采集点 @@@@@@*/

    /*++++++ x27-1-- 数据 ++++++*/
    'y270101' => '创建采集点成功',
    'x270101' => '创建采集点失败',
    'y270102' => '采集点存在',
    'x270102' => '采集点不存在',
    'y270103' => '更新采集点成功',
    'x270103' => '没有做任何修改',
    'y270104' => '删除采集点成功',
    'x270104' => '未删除任何采集点',
    'y270105' => '创建采集点表成功',
    'x270105' => '创建采集点表失败',
    'y270106' => '更新采集点表成功',
    'x270106' => '没有做任何修改',
    'y270107' => '删除采集点表成功',
    'x270107' => '未删除任何表',

    'y270111' => '无需更新采集点表',
    'y270112' => '克隆采集点成功',
    'x270112' => '克隆采集点失败',

    /*++++++ x27-2-- 验证 ++++++*/
    'x270201' => '请输入采集点名称',
    'x270202' => '采集点名称不能超过 100 中文，300 英文',
    'x270203' => '请输入目标 URL',
    'x270204' => '目标 URL 不能超过 900 字符',
    'x270205' => '保留标签不能超过 300 字符',
    'x270206' => '请选择隶属栏目',
    'x270207' => '隶属栏目 ID 必须为数字',
    'x270208' => '请选择状态',
    'x270209' => '备注不能超过 10 中文，30 英文',
    'x270210' => '目标 URL 格式错误',
    'x270211' => '请输入字符编码',
    'x270212' => '字符编码不能超过 100 字符',
    'x270213' => '获取采集点 ID 错误',
    'x270214' => '请输入列表选择器',
    'x270215' => '列表选择器不能超过 100 字符',
    'x270216' => '请输入分页链接选择器',
    'x270217' => '分页链接选择器不能超过 100 字符',
    'x270218' => '请输入分页内容选择器',
    'x270219' => '分页内容选择器不能超过 100 字符',
    'x270220' => '时间选择器不能超过 100 字符',
    'x270221' => '来源选择器不能超过 100 字符',
    'x270222' => '作者选择器不能超过 100 字符',
    'x270223' => '图片地址属性不能超过 100 字符',
    'x270224' => '分页内容过滤器不能超过 100 字符',
    'x270225' => '分页链接过滤器不能超过 100 字符',
    'x270226' => '列表过滤器不能超过 100 字符',
    'x270227' => '标题过滤器不能超过 100 字符',
    'x270228' => '内容过滤器不能超过 100 字符',
    'x270229' => '时间过滤器不能超过 100 字符',
    'x270230' => '来源过滤器不能超过 100 字符',
    'x270231' => '作者过滤器不能超过 100 字符',
    'x270232' => '请输入标题选择器',
    'x270233' => '标题选择器不能超过 100 字符',
    'x270234' => '请输入内容选择器',
    'x270235' => '内容选择器不能超过 100 字符',
    'x270236' => '分页内容属性不能超过 100 字符',
    'x270237' => '标题属性不能超过 100 字符',
    'x270238' => '内容属性不能超过 100 字符',
    'x270239' => '时间属性不能超过 100 字符',
    'x270240' => '来源属性不能超过 100 字符',
    'x270241' => '作者属性不能超过 100 字符',
    'x270242' => '允许的属性不能超过 100 字符',
    'x270243' => '忽略标签不能超过 100 字符',
    'x270244' => '图片过滤器不能超过 100 字符',

    /*++++++ x27-3-- 权限 ++++++*/
    'x270301' => '您没有浏览采集点的权限',
    'x270302' => '您没有创建采集点的权限',
    'x270303' => '您没有编辑采集点的权限',
    'x270304' => '您没有删除采集点的权限',

    /*++++++ x27-4-- 状态 ++++++*/
    'x270401' => '尚未创建采集点',
    'y270402' => '正在生成静态页面',
    'y270403' => '生成静态页面成功',
    'x270404' => '该采集点暂时无法生成',




    /*@@@@@@ x28---- 采集点 @@@@@@*/

    /*++++++ x28-1-- 数据 ++++++*/
    'y280101' => '采集成功',
    'x280101' => '采集失败',
    'y280102' => '文章已存在',
    'x280102' => '文章不存在',
    'y280103' => '更新采集成功',
    'x280103' => '没有做任何修改',
    'y280104' => '删除采集成功',
    'x280104' => '未删除任何采集',
    'y280105' => '创建采集表成功',
    'x280105' => '创建采集表失败',
    'y280106' => '更新采集表成功',
    'x280106' => '没有做任何修改',
    'y280107' => '删除采集表成功',
    'x280107' => '未删除任何表',

    'y280111' => '无需更新采集表',

    /*++++++ x28-2-- 验证 ++++++*/
    'x280201' => '缺少 KEY',
    'x280202' => '标题选择器未定义',
    'x280203' => '列表选择器未定义',
    'x280204' => '获取采集 ID 错误',
    'x280205' => '缺少标题',

    /*++++++ x28-3-- 权限 ++++++*/
    'x280301' => '您没有浏览采集的权限',
    'x280302' => '您没有采集的权限',
    'x280303' => '您没有编辑采集的权限',
    'x280304' => '您没有删除采集的权限',

    /*++++++ x28-4-- 状态 ++++++*/
    'y280401' => '采集完毕',
    'y280402' => '正在入库',
    'x280402' => '已入库',
    'y280403' => '入库成功',
    'x280403' => '入库失败',
    'y280404' => '入库完毕',
);
