<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------链接文字------*/
    'href' => array(
        'add'             => '创建', //创建
        'edit'            => '编辑', //编辑
        'help'            => '帮助',
        'show'            => '查看',
    ),

    /*------说明文字------*/
    'label' => array(
        'id'              => 'ID', //ID
        'all'             => '全部',
        'key'             => '关键词', //关键词
        'status'          => '状态', //状态
        'note'            => '备注', //备注

        'appName'         => '应用名称',
        'appId'           => 'APP ID',
        'appKey'          => 'APP KEY 通信密钥',
        'appKeyNote'      => '如果 APP KEY 泄露，可以通过重置更换，原 APP KEY 将作废。',
        'appNotify'       => '通知接口 URL',
        'allow'        => '权限', //系统权限
        'apiUrl'          => 'API 接口 URL',

        'ipAllow'         => '允许通信 IP',
        'ipBad'           => '禁止通信 IP',
        'ipNote'          => '每行一个 IP，可使用通配符 <strong>*</strong> （如 192.168.1.*）',
    ),

    'status' => array(
        'enable'  => '启用', //生效
        'disable' => '禁用', //禁用
    ),

    'option' => array(
        'allStatus'         => '所有状态', //所有
        'batch'             => '批量操作', //批量操作
        'del'               => '永久删除', //删除
    ),

    /*------按钮------*/
    'btn' => array(
        'submit'      => '提交', //提交
        'save'        => '保存', //提交
        'resetKey'    => '重置 APP KEY',
    ),

    /*------确认框------*/
    'confirm' => array(
        'del'         => '确认永久删除吗？此操作不可恢复！', //确认清空回收站
        'resetKey'    => '确认重置吗？此操作不可恢复！',
    ),
);
