<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    'label' => array(
        'id'        => 'ID',
        'status'    => '状态',
        'pageNo'    => '页数',
        'pageCount' => '第', //首页
        'pagePage'  => '页', //首页
        'pageNo'          => '页数',
        'pageCount'       => '第', //首页
        'pagePage'        => '页', //首页
    ),
);