<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------页面标题------*/
    'page' => array(
        'add'   => '创建', //创建
        'edit'  => '编辑', //编辑
        'show'  => '查看',
    ),

    /*------链接文字------*/
    'href' => array(
        'add'   => '创建', //创建
        'edit'  => '编辑', //编辑
        'show'  => '查看',
        'help'  => '帮助',
    ),

    /*------说明文字------*/
    'label' => array(
        'id'            => 'ID', //ID
        'all'           => '全部',
        'key'           => '关键词', //关键词

        'group'         => '群组', //组名
        'groupName'     => '组名', //组名
        'groupAllow'    => '系统权限', //系统权限

        'type'          => '类型',
        'status'        => '状态',
        'note'          => '备注',
    ),

    'status' => array(
        'enable'    => '启用', //发布
        'disable'   => '禁用', //隐藏
    ),

    'type' => array(
        'admin'     => '管理组', //管理组
    ),

    'option' => array(
        'allType'   => '所有类型', //所有
        'batch'     => '批量操作', //批量操作
        'del'       => '永久删除', //删除
    ),

    'btn' => array(
        'submit'    => '提交', //提交
        'save'      => '保存',
    ),


    'confirm' => array(
        'del'       => '确认永久删除吗？此操作不可恢复！', //确认清空回收站
    ),
);
