<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    'href' => array(
        'add'   => '创建',
        'help'  => '帮助',
        'edit'  => '编辑', //编辑
    ),

    /*------说明文字------*/
    'label' => array(
        'id'            => 'ID',
        'all'           => '全部',
        'key'           => '关键词',
        'mark'          => '标记', //标记
        'noname'        => '未命名', //未命名
    ),

    'confirm' => array(
        'del' => '确认永久删除吗？此操作不可恢复！', //确认清空回收站
    ),

    'btn' => array(
        'del'           => '永久删除', //删除
        'save'          => '保存', //提交
    ),
);
