<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------页面标题------*/
    'page' => array(
        'profile'           => '管理员个人资料',
    ),

    'label' => array(
        'id'              => 'ID', //ID
        'status'          => '状态',
        'type'            => '类型',
        'adminGroup'      => '隶属群组', //管理组
        'username'        => '用户名', //用户名
        'password'        => '密码', //密码
        'nick'            => '昵称',
        'cateAllow'       => '栏目管理权限', //栏目权限
        'passOld'         => '旧密码', //密码
        'passNew'         => '新密码', //密码
        'passConfirm'     => '确认密码', //密码
        'secQues'         => '密保问题',
        'secAnsw'         => '密保答案',
        'mailOld'         => '原邮箱',
        'mailNew'         => '新邮箱',
    ),

    'quesOften' => array(
        '您祖母叫什么名字',
        '您祖父叫什么名字',
        '您的生日是什么时候',
        '您母亲的名字',
        '您父亲的名字',
        '您宠物的名字叫什么',
        '您的车号是什么',
        '您的家乡是哪里',
        '您小学叫什么名字',
        '您最喜欢的颜色',
        '您女儿/儿子的小名叫什么',
        '谁是您儿时最好的伙伴',
        '您最尊敬的老师的名字',
    ),

    'status' => array(
        'enable'  => '启用', //发布
        'disable' => '禁用', //隐藏
    ),

    'type' => array(
        'normal'   => '普通管理员', //简体中文
        'super'    => '超级管理员', //英语
    ),

    'option' => array(
        'pleaseQuesOften'   => '请选择常用密保问题',
    ),

    'allow' => array(
        'add'     => '创建',
        'edit'    => '编辑',
        'del'     => '删除',
        'approve' => '审核',
        'cate'    => '栏目信息',
    ),

    'btn' => array(
        'save'        => '保存', //提交
    ),
);
