<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(

    /*------链接文字------*/
    'href' => array(
        'add'   => '创建', //创建
        'edit'  => '编辑', //编辑
        'help'  => '帮助',
        'show'  => '查看',
    ),

    'type' => array(
        'ratio'   => '比例', //按比例
        'cut'     => '裁切', //裁切
    ),

    /*------说明文字------*/
    'label' => array(
        'id'            => 'ID', //ID
        'all'           => '全部',
        'key'           => '关键词', //关键词

        'thumbWidth'    => '最大宽度', //缩略图宽度
        'thumbHeight'   => '最大高度', //缩略图高度
        'thumbType'     => '缩略图类型', //裁切类型
        'thumbCall'     => '调用键名', //调用名
        'to'            => '至',

        'rangeId'       => '附件 ID 范围',
    ),

    'btn' => array(
        'submit'    => '提交', //提交
        'save'      => '保存', //提交
        'thumbGen'  => '重新生成缩略图',
    ),

    'option' => array(
        'batch' => '批量操作', //批量操作
        'del'   => '永久删除', //删除
        'cache' => '更新缓存',
    ),

    'confirm' => array(
        'del'   => '确认永久删除吗？此操作不可恢复！', //确认清空回收站
        'gen'   => '确认重新生成吗？此操作将耗费较长时间！', //确认清空回收站
    ),
);
